KC5-BP/C8051F020-WS2812B/Strip/ws2812-Strip.c
/*-->	Title	:	KBP_NeoPixel_SM
		  |
		  '->	Source	:	Timers_Wait_Xms.h (One of my own first header file)
		  |
		  '->	Creation	:	21.11.2019
		  :			|
		  :			'->	Last Update	:	March 2020
		  |
		  '->	Description	:	Declarations of NeoPixels Usage functions.
*/
/*========================================================================================>
=========================================================================================*/
// Linker to : ...
#include <c8051f020.h>		// ... definition folder SFR 
													// (Like Port Definition "P5", "P6", etc...)
// ... C51/C166 routines that instructs the compiler to generate intrinsic code | _nop_():
#include <intrins.h>
#include "Base_SFR.h"	// ... Base(define, sbit, sfr,...)
#include "Time.h"		// ... Timers function and Waiting Function.
#include "NeoPixel.h"	// ... Timers function and Waiting Function.

//-- GLOBAL VARIABLES	INIT:------------------------------->
xdata tstr_NeoPixel Strip[MAX_LED] = {{0, 0, 0}, 0, 0};  // Initialize it to '0'.
																				// & the Position is a Var. that can be not used.
//xdata NeoPixel Matrix[MAX_LED] = {{0, 0, 0}, 0};  // Initialize it to '0'.
																				// & the Position is a Var. that can be not used.
//NeoPixel* Strip[MAX_LED];


// uint16 NeoPix_PosRecov(int8 _i8_PosX, int8 _i8_PosY)
// // Description	:	Recovered the position of a LED with the Line and Column.
// //								(Input Value from 1, instead of 0).
// // Date 		:	03.11.2019
// // Input		:	_iLin,	1byte
// //						_iCol,	1byte
// // Output	 	:	The position value.
// // Representation - Initial : 0/360 :
// // 					3 :	 / - - - - - - - -  -  -  -  -  -  -  /  
// // 					2 :  \ - - - - - - - -  -  -  -  -  -  -  \.
// // 					1 :  - - - - - - - - -  -  -  -  -  -  -  /  
// //Starting LED -´1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
// //
// // Representation - Rotated : 270/-90 :
// // | | | | | | | | |  |  |  |  |  |  |  | : 3
// // | | | | | | | | |  |  |  |  |  |  |  | : 2
// // | \ / \ / \ / \ /  \  /  \  /  \  /  | : 1  
// // 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16`- Starting LED.
// {	// Var. Dec. : 
// 	uint8 ui8_NewX = 0, ui8_NewY = 0;	
// 	uint8 ui8_X = 0, ui8_Y = 0;
// 	uint16 ui16_MatOffset = 0;
// 	uint16 ui16_ReturnPos = 0;
// 	// Condition about starting from 1, instead of 0.
// 	if(_i8_PosX == 0) { ui8_X = 1; } else { ui8_X = _i8_PosX;}
// 	if(_i8_PosY == 0) { ui8_Y = 1; } else { ui8_Y = _i8_PosY;}
// 	switch(MatFormat.i16_MatOri)
// 	{
// 		case 0:
// 		case 360:
// 		case (-360):
// 			// Condition about the Line being Even or not.
// 			// Then, by the Matrix routing, define how the WS281x must be adressed.
// 			if((_i8_PosY % 2) == 0)
// 			{
// 				if(ui8_X <= MAX_COLUMN)
// 				{
// 					ui8_NewX = MAX_COLUMN - ui8_X;
// 					ui16_MatOffset = 0;
// 				}
// 				else
// 				{
// 					if(ui8_X <= (2 * MAX_COLUMN))
// 					{
// 						ui8_NewX = (2 * MAX_COLUMN) - ui8_X;
// 						ui16_MatOffset = MAX_COLUMN * MAX_LINE;
// 					}
// 					else
// 					{
// 						ui8_NewX = (3 * MAX_COLUMN) - ui8_X;
// 						ui16_MatOffset = 2 * MAX_COLUMN * MAX_LINE;
// 					}
// 				}
// 			}
// 			else
// 			{
// 				if(ui8_X <= MAX_COLUMN)
// 				{
// 					ui8_NewX = (ui8_X - 1);
// 					ui16_MatOffset = 0;
// 				}
// 				else
// 				{
// 					if(ui8_X <= (2 * MAX_COLUMN))
// 					{
// 						ui8_NewX = (ui8_X - MAX_COLUMN - 1);
// 						ui16_MatOffset = MAX_COLUMN * MAX_LINE;
// 					}
// 					else
// 					{
// 						ui8_NewX = (ui8_X - (2 * MAX_COLUMN) - 1);
// 						ui16_MatOffset = 2 * MAX_COLUMN * MAX_LINE;
// 					}
// 				}
// 			}
// 			ui16_ReturnPos = (((ui8_Y - 1) * MAX_COLUMN) + ui8_NewX) + ui16_MatOffset;
// 			break;
// 			
// 			
// 		case 90:
// 		case (-270):
// 			// Condition about the Line being Even or not.
// 			// Then, by the Matrix routing, define how the WS281x must be adressed.
// 			if((_i8_PosX % 2) == 0)
// 			{
// 				ui8_NewY = (MAX_LINE - 1) - _i8_PosY;
// 			}
// 			else
// 			{
// 				ui8_NewY = _i8_PosY;
// 			}
// 			ui16_ReturnPos = (((_i8_PosX-1) * MAX_COLUMN) + ui8_NewY);
// 			break;
// 		
// 		case 180:
// 		case (-180):
// 			// Condition about the Line being Even or not.
// 			// Then, by the Matrix routing, define how the WS281x must be adressed.
// 			if((_i8_PosY % 2) == 0)
// 			{
// 				ui8_NewX = MAX_COLUMN - ui8_X;
// 			}
// 			else
// 			{
// 				ui8_NewX = (ui8_X - 1);
// 			}
// 			ui16_ReturnPos = (((ui8_Y - 1) * MAX_COLUMN) + ui8_NewX);
// 			break;
// 			
// 			
// 		case 270:
// 		case (-90):
// 			// Condition about the Line being Even or not.
// 			// Then, by the Matrix routing, define how the WS281x must be adressed.
// 			if((_i8_PosX % 2) == 0)
// 			{
// 				ui8_NewY = (MAX_LINE - 1) - _i8_PosY;
// 			}
// 			else
// 			{
// 				ui8_NewY = _i8_PosY;
// 			}
// 			ui16_ReturnPos = (((_i8_PosX - 1) * MAX_COLUMN) + ui8_NewY); // Checker les PosRecov en rotation.
// 			break;
// 			
// 		default :	/* State of every undefined case, so not supposed to come here. */	break;
// 	}
// 	return ui16_ReturnPos; // Return Pos.
// }

void NeoPix_SetColor(tstr_NeoPixel* _addMatrix, tstr_Color _newCol, uint16 _ui16_Pos)
// Description	:	Recovered the position of a LED with the Line and Column.
// Date 		:	03.11.2019
// Input		:	_iLin,	1byte
//						_iCol,	1byte
// Output	 	:	The position value.
{	// Var. Dec. :
				// To avoid problems about the parameters, I prefered to work with copies.
	uint8 Red = _newCol.ui8_Red;
	uint8 Green = _newCol.ui8_Green;
	uint8 Blue = _newCol.ui8_Blue;
	
	_addMatrix += (_ui16_Pos - 1);	// Set values to the selected Position.
	// Set Colors :
	_addMatrix->Col_Pix.ui8_Red = Red;
	_addMatrix->Col_Pix.ui8_Green = Green;
	_addMatrix->Col_Pix.ui8_Blue = Blue;
	// Set the Position value in the Struct. :
	_addMatrix->ui16_Pos = _ui16_Pos;
}

void NeoPix_Show(uint8 _Red, uint8 _Green, uint8 _Blue)
// Description :	Send the initiated Board on the Matrix.
// Date 			:	07.06.2018
// Input			:	_Red,	1byte.
//						_Green,		1byte.
//						_Blue,	1byte.
// Output	 	:	Nothing
{
//-Local Variables--------------------------------->
	uint8  byV_Red = _Red;
	uint8  byV_Green = _Green;
	uint8  byV_Blue = _Blue;

//-Code Function----------------------------------->	
	// For the WS2812b, the order is High bit to low AND Green - Red - Blue.
	// Sending GREEN.
	SEND_TO_LED(byV_Green, BIT7);
	SEND_TO_LED(byV_Green, BIT6);
	SEND_TO_LED(byV_Green, BIT5);
	SEND_TO_LED(byV_Green, BIT4);
	SEND_TO_LED(byV_Green, BIT3);
	SEND_TO_LED(byV_Green, BIT2);
	SEND_TO_LED(byV_Green, BIT1);
	SEND_TO_LED(byV_Green, BIT0);
	// Sending RED.
	SEND_TO_LED(byV_Red, BIT7);
	SEND_TO_LED(byV_Red, BIT6);
	SEND_TO_LED(byV_Red, BIT5);
	SEND_TO_LED(byV_Red, BIT4);
	SEND_TO_LED(byV_Red, BIT3);
	SEND_TO_LED(byV_Red, BIT2);
	SEND_TO_LED(byV_Red, BIT1);
	SEND_TO_LED(byV_Red, BIT0);
	// Sending BLUE.
	SEND_TO_LED(byV_Blue, BIT7);
	SEND_TO_LED(byV_Blue, BIT6);
	SEND_TO_LED(byV_Blue, BIT5);
	SEND_TO_LED(byV_Blue, BIT4);
	SEND_TO_LED(byV_Blue, BIT3);
	SEND_TO_LED(byV_Blue, BIT2);
	SEND_TO_LED(byV_Blue, BIT1);
	SEND_TO_LED(byV_Blue, BIT0);
}

void Matrix_Clear(tstr_NeoPixel* _addMatrix)
// Description :	Shut the matrix down.
// Date 			:	01.10.2019
// Input			:	Nothing.
// Output	 	:	Nothing, but sending data to MATRIX.
{	// Var. Dec. :
	uint16 i;
	tstr_NeoPixel* AddSave = _addMatrix;
	
