KC5-BP/C8051F020-WS2812B/Strip/ws2812-Strip.c
	for(i = 0; i < MAX_LED; i++)
	{	// Clear ALL Color in the original addresses ...
		_addMatrix->Col_Pix.ui8_Red = BRIGHT_MIN;
		_addMatrix->Col_Pix.ui8_Green = BRIGHT_MIN;
		_addMatrix->Col_Pix.ui8_Blue = BRIGHT_MIN;
		_addMatrix++;
	}
	Matrix_Show(AddSave);
}

void Matrix_ResetStatus(tstr_NeoPixel* _addMatrix)
{	// Var. Dec. :
	uint16 i;
	
	for(i = 0; i < MAX_LED; i++)
	{	// Clear ALL Color & Status in the original addresses ...
		_addMatrix->ui8_Status = 0;
		_addMatrix->Col_Pix.ui8_Red = BRIGHT_MIN;
		_addMatrix->Col_Pix.ui8_Green = BRIGHT_MIN;
		_addMatrix->Col_Pix.ui8_Blue = BRIGHT_MIN;
		_addMatrix++;
	}
}

// void Matrix_SetPos(uint8 _ui8_Col, uint8 _ui8_Lin)
// // Description	:	Recovered the position of a LED with the Line and Column.
// // Date 		:	03.11.2019
// // Input		:	_iLin,	1byte
// //						_iCol,	1byte
// // Output	 	:	The position value.
// {
// 	Offset.ui8_Colu = _ui8_Col;
// 	Offset.ui8_Line = _ui8_Lin;
// }

void Matrix_Show(tstr_NeoPixel* _addMatrix)
// Description :	Send the initiated Board on the Matrix.
// Date 			:	22.03.2020
// Input			:	_StructNeoPix*,	Address of a 4 * 1 byte structure.
// Output	 	:	Nothing
{	// Var. Dec. :
	xdata uint16 i;

	// Disable Timer to avoid interrupting Sending Paquets :
	TR0 = 0;
	
	for(i = 0; i < MAX_LED; i++)
	{
		NeoPix_Show(_addMatrix->Col_Pix.ui8_Red, _addMatrix->Col_Pix.ui8_Green, _addMatrix->Col_Pix.ui8_Blue);
		_addMatrix++;
	}
	
	// Enable / Re-activate Timer after Paquets Sent :
	TR0 = 1;
}

// void Matrix_Print(tstr_NeoPixel* _addMatrix, tstr_Color _newCol, const char* _CharToWrite, ...)
// // Description	:	Recovered the position of a LED with the Line and Column.
// // Date 		:	03.11.2019
// // Input		:	_iLin,	1byte
// //						_iCol,	1byte
// // Output	 	:	The position value.
// {	// Var. Dec. :
// 	xdata uint16 i;	// Y and Filling
// 	xdata uint8 j;	// X
// 	xdata uint8 Cnt_Lin = 0;	// For Char with different : Line
// 	xdata uint8 Cnt_Col = 0;	// For Char with different : Colu
// 	const char* cP_CharToPrint;	// Recover the actual char to print.
// 	xdata uint16 NeoPix_Pos = 0;	// Position recovery from an int to 
// 	xdata uint16 CharReadOrga = 0;	// Organisation about Reading the Char depending on the Matrix' Orientation.
// 	
// 	
// 	//xdata uint8 Test[28] = 0;	// After printing a char, swift for the next one.
// 	
// 	for(cP_CharToPrint = _CharToWrite; *cP_CharToPrint != '\0'; cP_CharToPrint++)
// 	{	
// 		switch(*cP_CharToPrint)
// 		{	// Height & Width can be vary so a first Switch..Case is necessary.
// 			// Letters : --------------------------------------------------->
// 			case 'A':	case 'B':	case 'C':	case 'D':	case 'E': case 'F':	
// 			/*case 'G':*/	case 'H':	case 'I':	case 'J': case 'K':	case 'L':	
// 			/*case 'N':*/ case 'O':	case 'P': /*case 'Q':*/	case 'R':	case 'S':	
// 			case 'T':	case 'U': /*case 'X':*/	case 'Y':	/*case 'Z':*/
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Big:
// 						Cnt_Col = 3;
// 						Cnt_Lin = 14;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;				
// 			case 'N':	case 'X':	case 'Z':
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Big:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 14;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;	
// 			case 'M':	case 'V':	case 'W':
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 5;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Big:
// 						Cnt_Col = 5;
// 						Cnt_Lin = 14;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;		
// 			case 'G':	case 'Q':
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Big:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 14;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;	
// 			// Numbers + Style : ------------------------------------------->
// 			case '0':	case '1':	case '2':	case '3':	case '4':
// 			case '5':	case '6':	case '7':	case '8':	case '9':
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Time:
// 						Cnt_Col = 5;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Mob:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 6;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;
// 			// Special Char. : --------------------------------------------->
// 			case '.':	case ',':	/*case '!':*/	/*case '?':*/
// 				Cnt_Col = 3;
// 				Cnt_Lin = 7;
// 				break;
// 			
// 			case '^':
// 				Cnt_Col = 7;
// 				Cnt_Lin = 6;
// 				break;
// 			
// 			case '\'':
// 				Cnt_Col = 2;
// 				Cnt_Lin = 7;
// 				break;
// 			
// 			case ')':
// 				Cnt_Col = 5;
// 				Cnt_Lin = 7;
// 				break;
// 			
// 			case '!': case '*': case ' ': case ':':
// 				Cnt_Col = 3;
// 				Cnt_Lin = 7;
// 				break;
// 			
// 			case '?':
// 				switch(MatFormat.i8_TxtFont)
// 				{
// 					case enu_Classic:
// 						Cnt_Col = 4;
// 						Cnt_Lin = 7;
// 						break;
// 					case enu_Mob:
// 						Cnt_Col = 5;
// 						Cnt_Lin = 7;
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				break;
// 				
// 			default :	/* State of every undefined case, so not supposed to come here. */	break;
// 		}
// 		
// 		for(i = 0; i < Cnt_Lin; i++)
// 		{	
// 			for(j = 0; j < Cnt_Col; j++)
// 			{	// Same Line :
// 				NeoPix_Pos = NeoPix_PosRecov((j+Offset.ui8_Colu), i+Offset.ui8_Line);
// 				//Test[(i*4) + j] = NeoPix_Pos;
// 				// Condition about possible value for displaying or not.
// 				if(NeoPix_Pos >= ((MAX_COLUMN * MAX_LINE) * MATRIX_NBR))
// 				{
// 					break;
// 				}
// 				else { /* Nothing. */ }		
// 				// Switch about definning how the char Board must be read.
// 				switch(MatFormat.i16_MatOri)
// 				{
// 					case 0:
// 					case 180:
// 					case 360:
// 					case (-180):
// 					case (-360):
// 						CharReadOrga = ((i * Cnt_Col) - j);
// 						break;
// 					case 90:
// 					case 270:
// 					case (-90):
// 					case (-270):
// 						CharReadOrga = (((i + 1) * Cnt_Col) - (j + 1));
// 						break;
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				switch(*cP_CharToPrint)
// 				{
// 					case 'A':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_A[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_A_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'B':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_B[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_B_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'C':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_C[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_C_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'D':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_D[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_D_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'E':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_E[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_E_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'F':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_F[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_F_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'G':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_G[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_G_Big[OFF_CHAR_DIM_4X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'H':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_H[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_H_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'I':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_I[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_I_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'J':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_J[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_J_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'K':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_K[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_K_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'L':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_L[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_L_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'M':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_M[OFF_CHAR_DIM_5X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_M_Big[OFF_CHAR_DIM_5X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'N':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_N[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_N_Big[OFF_CHAR_DIM_4X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'O':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_O[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_O_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'P':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_P[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_P_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'Q':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Q[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Q_Big[OFF_CHAR_DIM_4X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'R':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_R[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_R_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'S':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_S[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_S_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'T':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_T[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_T_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'U':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_U[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_U_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'V':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_V[OFF_CHAR_DIM_5X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_V_Big[OFF_CHAR_DIM_5X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'W':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_W[OFF_CHAR_DIM_5X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_W_Big[OFF_CHAR_DIM_5X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'X':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_X[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_X_Big[OFF_CHAR_DIM_4X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'Y':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Y[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Y_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					case 'Z':
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Z[OFF_CHAR_DIM_4X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Z_Big[OFF_CHAR_DIM_4X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 					
// 					case ' ': 
// 						switch(MatFormat.i8_TxtFont)
// 						{
// 							case enu_Classic:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Space[OFF_CHAR_DIM_3X7 - CharReadOrga];
// 								break;
// 							case enu_Big:
// 								_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Space_Big[OFF_CHAR_DIM_3X14 - CharReadOrga];
// 								break;
// 							default :	/* State of every undefined case, so not supposed to come here. */	break;
// 						}
// 						break;
// 						
// 					case ':':
// 						_addMatrix[NeoPix_Pos].ui8_Status = cBoard_Colon[OFF_CHAR_DIM_3X7 - CharReadOrga];
// 						break;
// 					
// 					case ')':
// 						_addMatrix[NeoPix_Pos].ui8_Status = cBoard_CloseBracket[OFF_CHAR_DIM_5X7 - CharReadOrga];
// 						break;
// 					
// 					case '\n':
// 						Offset.ui8_Colu = 1;
// 						Offset.ui8_Line -= 8;	// Decrease Line of Height + 1 line to make a space.
// 						//Offset.ui8_Line = 3;
// 						break;
// 					
// 					default :	/* State of every undefined case, so not supposed to come here. */	break;
// 				}
// 				
// 				// Coloring only One char at a Time :
// 				if(_addMatrix[NeoPix_Pos].ui8_Status != 0)
// 				{
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Red = _newCol.ui8_Red;
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Green = _newCol.ui8_Green;
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Blue = _newCol.ui8_Blue;
// 				}
// 				else
// 				{
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Red = BRIGHT_MIN;
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Green = BRIGHT_MIN;
// 					_addMatrix[NeoPix_Pos].Col_Pix.ui8_Blue = BRIGHT_MIN;
// 				}
// 			}
// 		}
// 		if(*cP_CharToPrint != '\n')
// 		{
// 			// Position Increment on X :
// 			Offset.ui8_Colu += (Cnt_Col + 1);
// 		}
// 		else
// 		{ /* Nothin', avoid increase Col. after a \n. */ }
// 	}
// }


void Matrix_LimitPos(tstr_NeoPixel* _addMatrix, tstr_Color _newCol, uint16 _Begin, uint16 _End)
{	// Var. Dec. :
	uint16 i;	// LED Position for filling Board of neoPix.
	// To avoid problems about the parameters, I prefered to work with copies.
	tstr_NeoPixel* AddSave = _addMatrix;
	
