KC5-BP/C8051F020-WS2812B/Strip/ws2812-Strip.c
	for(i = 0; i < MAX_LED; i++)
	{
		if((i >= _Begin) && (i <= _End))
		{
			_addMatrix->Col_Pix.ui8_Red = _newCol.ui8_Red;
			_addMatrix->Col_Pix.ui8_Green = _newCol.ui8_Green;
			_addMatrix->Col_Pix.ui8_Blue = _newCol.ui8_Blue;
		}
		else
		{
			_addMatrix->Col_Pix.ui8_Red = BRIGHT_MIN;
			_addMatrix->Col_Pix.ui8_Green = BRIGHT_MIN;
			_addMatrix->Col_Pix.ui8_Blue = BRIGHT_MIN;
		}
		_addMatrix++;
	}
	Matrix_Show(AddSave);
}

void Matrix_InvertArray(tstr_NeoPixel* _addMatrix)
{	// Var. Dec. :
	xdata uint16 i;	// LED Position for filling Board of neoPix.
	xdata uint16 j;	// Address recovering counter of the matrix.
	// To avoid problems about the parameters, I prefered to work with copies.
	tstr_NeoPixel* AddSave = _addMatrix;
	xdata tstr_Color tmp = {0, 0, 0};
	
	for(i = 0; i < MAX_LED; i++)
	{
		if((_addMatrix->Col_Pix.ui8_Red != 0) || (_addMatrix->Col_Pix.ui8_Green != 0) || (_addMatrix->Col_Pix.ui8_Blue != 0))
		{
			tmp.ui8_Red = _addMatrix->Col_Pix.ui8_Red;
			tmp.ui8_Green = _addMatrix->Col_Pix.ui8_Green;
			tmp.ui8_Blue = _addMatrix->Col_Pix.ui8_Blue;
			break;
		}
		_addMatrix++;
	}
	
	for(i = 0; i < j; i++)
	{
		_addMatrix--;
	}
	
	for(i = 0; i < MAX_LED; i++)
	{
		if(_addMatrix->ui8_Status == 0)
		{
			_addMatrix->ui8_Status = 1;
			_addMatrix->Col_Pix.ui8_Red = tmp.ui8_Red;
			_addMatrix->Col_Pix.ui8_Green = tmp.ui8_Green;
			_addMatrix->Col_Pix.ui8_Blue = tmp.ui8_Blue;
		}
		else
		{
			_addMatrix->ui8_Status = 0;
			_addMatrix->Col_Pix.ui8_Red = BRIGHT_MIN;
			_addMatrix->Col_Pix.ui8_Green = BRIGHT_MIN;
			_addMatrix->Col_Pix.ui8_Blue = BRIGHT_MIN;
		}
		_addMatrix++;
	}
}